tap "homebrew/cask"
tap "homebrew/core"

brew "bottom"
brew "cmake"
brew "coreutils"
brew "coursier"
brew "fd"
brew "fish"
brew "fzf"
brew "git-delta"
brew "git-lfs"
brew "go"
brew "gum"
brew "jq"
brew "lazygit"
brew "lua-language-server"
brew "luarocks"
brew "neovim"
brew "pipx"
brew "ruff-lsp"
brew "sd"
brew "stow"
brew "syncthing", restart_service: :changed
brew "tinymist"
brew "typst"
brew "oven-sh/bun/bun"

cask "claude"
cask "ghostty"
cask "karabiner-elements"
cask "keepassxc"

main ./Brewfile.$HOSTNAME
