brew "bottom"
brew "cmake"
brew "coreutils"
brew "coursier"
brew "fd"
brew "fish"
brew "fzf"
brew "git-delta"
brew "git-lfs"
brew "go"
brew "gum"
brew "jq"
brew "lazygit"
brew "lua-language-server"
brew "luarocks"
brew "neovim"
brew "pipx"
brew "ruff-lsp"
brew "sd"
brew "stow"
brew "syncthing"
brew "tinymist"
brew "typst"
brew "oven-sh/bun/bun"
brew "yarn"
brew "cargo-binstall"
brew "coursier/formulas/coursier"
brew "pyenv"
brew "bruno"
brew "node"

cask "claude"
cask "ghostty"
cask "karabiner-elements"
cask "keepassxc"
cask "font-cascadia-code"
cask "font-cascadia-code-pl"
cask "docker"
cask "hammerspoon"

# main ./Brewfile.$HOSTNAME
