tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "libsql/sqld"
tap "michaeleisel/zld"
tap "omnisharp/omnisharp-roslyn"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "qmk/qmk"
tap "shopify/shopify"
tap "tim-harding/neophyte", "https://github.com/tim-harding/homebrew-neophyte.git"
tap "tursodatabase/tap"
brew "boost"
brew "bottom"
brew "cargo-binstall"
brew "cmake"
brew "coreutils"
brew "harfbuzz"
brew "coursier"
brew "fd"
brew "python@3.12"
brew "ffmpeg"
brew "ncurses"
brew "fish"
brew "flyctl"
brew "fourmolu"
brew "fswatch"
brew "fzf"
brew "gcc"
brew "gcc@11"
brew "gh"
brew "ghcup"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "googletest"
brew "gum"
brew "haskell-language-server"
brew "helix"
brew "imagemagick"
brew "jq"
brew "kanata"
brew "lazygit"
brew "leela-zero"
brew "libraqm"
brew "llvm"
brew "lua-language-server"
brew "luarocks"
brew "make"
brew "minicom"
brew "mold"
brew "navi"
brew "neovim"
brew "node"
brew "nushell"
brew "ouch"
brew "pass"
brew "pass-git-helper"
brew "pass-otp"
brew "pillow"
brew "pinentry-mac"
brew "pipx"
brew "pkgconf"
brew "postgresql@14", restart_service: :changed
brew "pyenv"
brew "pyright"
brew "python@3.10"
brew "python@3.9"
brew "resvg"
brew "ruby"
brew "ruff-lsp"
brew "sd"
brew "sox"
brew "starship"
brew "stow"
brew "swi-prolog"
brew "swiftformat"
brew "swiftlint"
brew "syncthing", restart_service: :changed
brew "telnet"
brew "tinymist"
brew "tmux"
brew "typst"
brew "xcbeautify"
brew "xcode-build-server"
brew "xcodegen"
brew "yarn"
brew "yazi"
brew "zellij"
brew "zig"
brew "zls"
brew "michaeleisel/zld/zld"
brew "oven-sh/bun/bun"
brew "qmk/qmk/qmk"
brew "shopify/shopify/shopify-cli"
brew "tursodatabase/tap/turso"
cask "alacritty"
cask "bruno"
cask "claude"
cask "font-maple-mono"
cask "ghostty"
cask "karabiner-elements"
cask "katrain"
cask "keepassxc"
cask "mactex"
cask "reaper"
cask "scroll-reverser"
vscode "catppuccin.catppuccin-vsc"
vscode "vscodevim.vim"
vscode "vue.volar"
