jorgebucaran/fisher
danhper/fish-ssh-agent
catppuccin/fish
edc/bass
jorgebucaran/replay.fish
jethrokuan/z
lilyball/nix-env.fish
jorgebucaran/fishtape
jorgebucaran/nvm.fish
ilancosman/clownfish
~/code/github.com/IlanCosman/tide/tharding/no-branch-name/main
